In [1]:
import modin.pandas as ray
import pandas as pd

Process STDOUT and STDERR is being redirected to /tmp/ray/session_2019-04-03_14-31-46_9288/logs.
Waiting for redis server at 127.0.0.1:17991 to respond...
Waiting for redis server at 127.0.0.1:32056 to respond...
Starting Redis shard with 10.0 GB max memory.
Starting the Plasma object store with 10.0 GB memory using /tmp.

In [2]:
ray_df = ray.read_csv('data/titanic.csv')

In [3]:
df = pd.read_csv('data/titanic.csv')

In [4]:
df.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
ray_df.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
ray_df = ray.read_json("/Users/gift/github/Data/wisconsin_1gb.adm", lines=True)

UserWarning: `read_json` defaulting to pandas implementation.

In [8]:
ray_df.head()

,evenOnePercent,fiftyPercent,four,oddOnePercent,onePercent,string4,stringu1,stringu2,ten,tenPercent,twenty,twentyPercent,two,unique1,unique2,unique3
0,0,0,0,1,0,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,0,0,0,0,0,0,0,0
1,184,0,0,185,92,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,BAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,CQYAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,2,2,12,2,0,1792,1,1792
2,168,0,0,169,84,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,CAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,FHWAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,4,4,4,4,0,3584,2,3584
3,152,0,0,153,76,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,DAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,HYUAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,6,6,16,1,0,5376,3,5376
4,136,0,0,137,68,AAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,EAAAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,KPSAAAAXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...,8,8,8,3,0,7168,4,7168

In [10]:
ray_df[['two','evenOnePercent']].head()

   two  evenOnePercent
0    0               0
1    0             184
2    0             168
3    0             152
4    0             136

In [12]:
import time

In [22]:
start = time.time()
print(len(ray_df[(ray_df['ten'] == 1) & (ray_df['twentyPercent'] == 1) & (ray_df['two'] == 1)]))
stop = time.time()
print('Pandas on Ray elapsed time: %f sec.' %(stop-start))

200000
Pandas on Ray elapsed time: 3.479249 sec.

In [23]:
df = pd.read_json("/Users/gift/github/Data/wisconsin_1gb.adm", lines=True)

In [24]:
start = time.time()
print(len(df[(df['ten'] == 1) & (df['twentyPercent'] == 1) & (df['two'] == 1)]))
stop = time.time()
print('Pandas elapsed time: %f sec.' %(stop-start))

200000
Pandas elapsed time: 0.116603 sec.

In [28]:
start = time.time()
len(ray_df)
stop = time.time()
print('Pandas on Ray elapsed time: %f sec' % (stop-start))

Pandas on Ray elapsed time: 0.000058 sec

In [29]:
start = time.time()
len(df)
stop = time.time()
print('Pandas elapsed time: %f sec' % (stop-start))

Pandas elapsed time: 0.000055 sec

In [30]:
ray_df.groupby('twenty').agg({"four": "max"})

UserWarning: `<lambda>` defaulting to pandas implementation.

    four
0      0
1      1
2      2
3      3
4      0
5      1
6      2
7      3
8      0
9      1
10     2
11     3
12     0
13     1
14     2
15     3
16     0
17     1
18     2
19     3